<?php
use Cake\Core\Configure;
    //添付ファイル登録先パス
    define("D_TEMP_PATH","tmp/");
    
        if(@$_SERVER[ 'HTTP_HOST' ] == "local-renew"){
            $url = "http://local-renew/";
            define("D_BASE_URL",$url);
            define("D_TEST_URL",$url."t/");
        }else{
            define("D_BASE_URL","https://e-wel.com");
            define("D_TEST_URL","https://test.e-wel.com");
            
        }

    define("D_HOME_PATH","/");
    define("D_LIMIT","30"); //顧客管理画面の表の表示数
    define("D_LIMIT50","50"); //請求書の表示数
    define("D_TAX","1.1"); //消費税
    define("D_FILESIZE_LIMIT", "20000"); //アプロードファイルサイズ
    define("D_INFO_FILE_PATH", 'infoFile/'); //お知らせ情報添付ファイル登録先パス
    define("D_EXAM", 'http://local-exam:8080/'); //検査用

return [


    //会社情報
    Configure::write("D_COMPANY_PAY_BANK","みずほ銀行　九段支店"),
    Configure::write("D_COMPANY_PAY_NUM","普通1490303"),
    Configure::write("D_COMPANY_PAY_NAME","株式会社　イノベーションゲート"),
    Configure::write("D_COMPANY_POST1","160"),
    Configure::write("D_COMPANY_POST2","0023"),
    Configure::write("D_COMPANY_ADDRESS","東京都新宿区西新宿3-9-7"),
    Configure::write("D_COMPANY_ADDRESS2","BIZ SMART西新宿2階"),
    Configure::write("D_COMPANY_NAME","株式会社　イノベーションゲート"),
    Configure::write("D_COMPANY_TELNUM","03-6868-8391"),
    //添付ファイルステータス
    Configure::write("D_STATUS",[
        '0'=>'未開封',
        '1'=>'開封済'
        ]),
    //検査の追加削除
    Configure::write("D_EXAM_TYPE",[
        '1'=>"add_type",
        '2'=>"delete_type"
        ]),
    Configure::write("D_prefecture", ["北海道","青森県","岩手県","宮城県","秋田県","山形県","福島県","茨城県","栃木県","群馬県","埼玉県","千葉県","東京都","神奈川県","新潟県","富山県","石川県","福井県","山梨県","長野県","岐阜県","静岡県","愛知県","三重県","滋賀県","京都府","大阪府","兵庫県","奈良県","和歌山県","鳥取県","島根県","岡山県","広島県","山口県","徳島県","香川県","愛媛県","高知県","福岡県","佐賀県","長崎県","熊本県","大分県","宮崎県","鹿児島県","沖縄県"]),
    Configure::write("D_ELEMENT",[
        "自己感情モニタリング力	"
        ,"客観的自己評価力"
        ,"自己肯定力"
        ,"コントロール＆アチーブメント力"
        ,"ビジョン創出力"
        ,"ポジティブ思考力"
        ,"対人共感力"
        ,"状況察知力"
        ,"ホスピタリティ発揮力"
        ,"リーダーシップ発揮力"
        ,"アサーション発揮力"
        ,"集団適応力"
    ]),
    Configure::write("D_PDF_STATUS",[
        0=>"未開封",
        1=>"開封済"
       
    ]),
    Configure::write("D_GENDER",[
        0=>"その他",
        1=>"男性",
        2=>"女性"
       
    ]),
    /**受検時間 */
    Configure::write("D_EXAM_TIME",[
        10,20,30,40,50,60,70,80,90
    ]),
    /**受検状態ステータス */
    Configure::write("D_EXAM_STATE",[
        0=>"未受検",
        1=>"受検中",
        2=>"受検済"
    ]),
    /**合否ステータス */
    Configure::write("D_PASS",[
        0=>"未",
        1=>"合",
        2=>"不"
    ]),
    /***検査結果一覧画面でのヘッダのcolspanの数 */
    Configure::write("D_COLSPAN",[
        "BA"=>3,
        "EA"=>1,
        "MEA"=>1,
        "BMS"=>1,
        "BAV"=>2,
        "VF"=>1,
        "ESA"=>1,
        "FS"=>1,
        "SA"=>1,
        "IQ"=>1,
        "OCS"=>1,
        "NL"=>1,
        "PA"=>1,
        "MET"=>1,
        "SP"=>1,

    ]),
    /***PDFの出力確認ステータス */
    Configure::write("D_PDF_OUTPUT",[
        1=>"出力済",
        0=>"未出力",
    ]),
    /*
    //DBに登録したため利用しない
    Configure::write("D_EXAM_PDF",[
        2=>"行動価値検査結果レポート(面接版適合あり)"
        ,1=>"行動価値検査結果レポート(面接版適合なし)"
        ,3=>"行動価値検査結果レポート(ストレス版)"
        ,5=>"行動価値検査結果レポート(自己理解版)"
        ,9=>"行動価値検査結果レポート(A3 自己理解版)"
        ,11=>"行動価値検査結果レポート(面接版適合なし/日本生命用)"
        ,12=>"行動価値検査結果レポート(面接詳細版1)"
        ,13=>"行動価値検査結果レポート(面接詳細版2)"
        ,26=>"行動価値検査結果レポート(自己理解版 名前なし)"
        ,28=>"行動価値検査結果レポート(面接版適合あり)既存社員面談向け"
        ,29=>"行動価値検査結果レポート(自己理解版)既存社員向け"
        ,30=>"採用版：行動価値検査結果レポート(面接版適合あり)(PA版)"
        ,31=>"行動価値検査結果レポート(面接版適合なし)修正版"
        ,34=>"行動価値検査結果レポート(自己理解版)修正版"
        ,35=>"神戸教育委員会用"
        ,4=>"感情能力検査レポート"
        ,17=>"感情能力レポートT"
        ,6=>"行動意識検査"
        ,7=>"VF検査(採用価値基準検査/表紙なし)"
        ,8=>"VF検査(採用価値基準検査/表紙あり)"
        ,27=>"VF検査(採用価値基準検査/表紙あり)既存社員面談向け"
        ,15=>"コミュニケーション特性(NLPコーチング)"
        ,16=>"コミュニケーション特性(NLPコーチング) 氏名なし"
        ,18=>"コミュニケーション意識レポート"
        ,19=>"METアウトプット"
        ,20=>"添削内容アウトプット"
        ,21=>"メンタルヘルス対策実施状況診断"
        ,22=>"個人結果報告書(EQ/IQ/BAJ)"
        ,24=>"個人結果シート(パワハラ)"
        ,14=>"BMS検査結果レポート(自己理解版)"
        ,23=>"BMS検査結果レポート(面接版)"
        ,25=>"ブランド感度力診断"
        ,32=>"AA-C PDF"
        ,33=>"AA-P PDF"
    ]),
    */
    /*
    Configure::write("D_EXAM_BASE",[
        "BA"=>[
            1=>"BA-J1",
            2=>"BA-J2",
            12=>"BA-J3",
            72=>"PFS",
            73=>"BA-J4"
        ]
        ,"EA"=>[
            5=>"EA-S",
            7=>"EA-BJ",
            31=>"EA-S2",
            47=>"EA-BJ2",
            66=>"EA-BJ2",
            74=>"EA-BJ4",
        ]
        ,"FS"=>[
            3=>"FS",
        ]
        ,"VF"=>[
            4=>"VF-J",
            33=>"VF-J2",
        ]
        ,"SA"=>[
            6=>"SA-J",
            37=>"SA-J2",
        ]
        ,"TH"=>[
            10=>"TH",
        ]
        ,"IQ"=>[
            11=>"IQ",
        ]
        ,"BMS"=>[
            13=>"BMS",
            35=>"BMS2",
            42=>"BMS-V",
        ]
        
        ,"OCS"=>[
            32=>"OCS",
        ]
        ,"NL"=>[
            34=>"NL-J",
            36=>"NL-J2",
            61=>"NL-J3",
        ]
        ,"PA"=>[
            38=>"PA-J",
        ]
        ,"SP"=>[
            39=>"SP-J",
        ]
        ,"MET"=>[
            40=>"MET",
        ]
        ,"BAV"=>[
            41=>"BA-V3",
        ]
        ,"LCP"=>[
            43=>"LCP",
        ]
        ,"CRT"=>[
            44=>"CRT",
            48=>"CRTS",
        ]
        ,"ESA"=>[
            45=>"ESA",
        ]
        ,"MMS"=>[
            46=>"MMS",
        ]
        ,"ELAN"=>[
            49=>"ELAN",
            53=>"ELAN2",
            58=>"ELAN3",
            59=>"ELAN4",
            65=>"ELAN5",
        ]
        ,"MEA"=>[
            50=>"MEA",
        ]
        ,"BSA0"=>[
            51=>"BSA0",
        ]
        ,"JUG"=>[
            52=>"JUG",
            60=>"JUG2",
            67=>"JUG3",
            68=>"JUG4",
        ]
        ,"CH"=>[
            54=>"BA-C",
            55=>"CBA-C",
            56=>"AAC-T",
            57=>"AAP-T",
        ]
        ,"ELANS"=>[
            69=>"ELANS1",
            71=>"ELANS2",
        ]
        ,"BEA"=>[
            70=>"BEA",
        ]
    ]),
    Configure::write("D_EXAM_BASE_JP",[
        "1"=>"行動価値検査"
       ,"2"=>"行動価値検査2"
       ,"3"=>"ＷｅｌｃｏｍｅＦＳ検査"
       ,"4"=>"ＶＦ検査"
       ,"5"=>"感情能力検査"
       ,"6"=>"行動意識検査"
       ,"7"=>"感情能力検査"
       ,"8"=>"行動価値検査"
       ,"9"=>"ＶＦ検査"
       ,"10"=>"多面評価検査"
       ,"11"=>"知的能力検査"
       ,"12"=>"行動価値検査3"
       ,"13"=>"数学検定検査"
       ,"14"=>"行動価値検査"
       ,"15"=>"行動価値検査"
       ,"16"=>"行動価値検査"
       ,"17"=>"行動価値検査"
       ,"18"=>"行動価値検査"
       ,"19"=>"行動価値検査"
       ,"20"=>"感情能力検査"
       ,"21"=>"感情能力検査"
       ,"22"=>"感情能力検査"
       ,"23"=>"ＶＦ検査"
       ,"24"=>"ＶＦ検査"
       ,"25"=>"行動意識検査"
       ,"26"=>"行動意識検査"
       ,"27"=>"行動意識検査"
       ,"28"=>"知的能力検査"
       ,"29"=>"行動意識検査"
       ,"30"=>"行動意識検査"
       ,"31"=>"感情能力検査"
       ,"32"=>"職場研究"
       ,"33"=>"ＶＦ検査"
       ,"34"=>"ＮＬ検査"
       ,"35"=>"数学検定検査"
       ,"36"=>"ＮＬ検査"
       ,"37"=>"行動意識検査"
       ,"38"=>"親用検査"
       ,"39"=>"共感力アセスメント"
       ,"40"=>"モンスター社員タイプ診断"
       ,"41"=>"行動価値検査(ベトナム語)"
       ,"42"=>"数学検定検査(ベトナム語)"
       ,"43"=>"LCP検査"
       ,"44"=>"添削"
       ,"45"=>"経済感度力アセスメント"
       ,"46"=>"メンタルヘルス対策実施状況診断"
       ,"47"=>"感情能力検査"
       ,"48"=>"添削"
       ,"49"=>"人権e"
       ,"50"=>"MEA"
       ,"51"=>"ブランド感度力診断"
       ,"52"=>"評価検査"
       ,"53"=>"人権e2"
       ,"54"=>"BA-C"
       ,"55"=>"CBA-C"
       ,"56"=>"AAC-T"
       ,"57"=>"AAP-T"
       ,"58"=>"人権e-ラーニング3"
       ,"59"=>"人権e-ラーニング4"
       ,"60"=>"評価検査2"
       ,"61"=>"NL-J3"
       ,"65"=>"人権e-ラーニング5"
       ,"66"=>"EA-BJ3"
       ,"67"=>"評価検査3"
       ,"68"=>"評価検査4"
       ,"69"=>"文書管理Learning"
       ,"70"=>"BEA"
       ,"71"=>"人権Learning"
       ,"72"=>"PFS"
       ,"73"=>"検査Ⅱ"
       ,"74"=>"検査Ⅰ"
   ]),
   */
   Configure::write("D_SYSTEM_TYPE",[
    "0"=>"通常検査",
    "1"=>"評価検査",
    "2"=>"添削",
    "3"=>"人権",
    "4"=>"評価検査",
   ]),
   Configure::write("D_LANGUAGE_TYPE",[
    "0"=>"日本語",
    "2"=>"中国語",
    "4"=>"ベトナム語",
   ]),

];
