<?= $name ?> <?=$rep_name?>様

<?=$partnername?>サポートデスクよりお知らせです。

<?=$testname?>の検査情報を受付ました。。
管理システムの検査受検が可能になりましたのでお知らせ致します。
ログインして、ご確認下さい。

##########################

顧客名:<?=$customername?>

検査名:<?=$testname?>

期間:<?=$term?>

受検者数:<?=$count?>

##########################


詳細な検査情報や、受検者用のIDは、管理画面にログインしてご確認ください。
以上、宜しくお願い致します。

---------------------------------------------
■ ご登録内容についてのお問い合わせ窓口 ■
<?=$partnername?> 担当:<?=$partner_rep_name?>
e-mail:<?=$partner_rep_email?>
---------------------------------------------
